Revit 2027 API
BuiltInFailures.CurtainWallFailures.CurtainGridFaceCannotBeReparamForGridRotation Property
 Curtain grids cannot be rotated exactly as requested. Push "Adjust Grids" to get the nearest valid rotation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurtainGridFaceCannotBeReparamForGridRotation { get; }
Public Shared ReadOnly Property CurtainGridFaceCannotBeReparamForGridRotation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurtainGridFaceCannotBeReparamForGridRotation {
	FailureDefinitionId^ get ();
}
static member CurtainGridFaceCannotBeReparamForGridRotation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace